Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 回楼上：“我草，不是吧，跟贞子似的，有被吓到。”
en_us: Replying to the comment above, "Damn it, seriously? She looks like Sadako, I got frightened."

source: 因为之前的事情，两人对叶漓也很是不喜。
en_us: They were also displeased with Ye Li because of what happened before.

source: 因为今天的事情恶劣，已经惊动了那个女生的家长，两夫妻看到女儿被伤成了那样，直接就闹到了校长那里，势必要他们学校给个交代。
en_us: Due to the severity of the incident today, the female student's parents had been alarmed and when they saw their daughter's injury, they were so infuriated that they decided to blow things up and get the principal involved. They insisted that the school give them an explanation.

source: 因为他不收废物。
en_us: It was because he would never manage any useless or talentless artistes.

source: 因为他们怎么也想不通，为什么一向担惊受怕的叶漓，突然就什么都不怕了，还当着那么多人的面和叶枫去吃饭。
en_us: They could not figure out why Ye Li, who had always been timid, was suddenly dauntless. She even had lunch with Ye Feng in front of so many people.

source: 因为他们觉得，叶漓这样的身份，根本就不配和他们的枫神接触。
en_us: Reason being they felt that Ye Li was not fit to be in contact with their idol, Ye Feng.

source: 因为他知道，自己越是容易低头，这些人就越瞧不上他！
en_us: He knew that the more he bowed down, the more they would despise and look down on him!

source: 因为叶家已经有了三个儿子，本来和齐名的徐家是早就准备好，一旦有女儿，就两家结亲，为此不知道有多少人暗地里诅咒这两家人千万不要生出女儿。
en_us: Due to the fact that the Ye Family already had three sons, the famous Xu Family was ready to let the two families unite through a marriage between their children, once the Ye Family's daughter was born. Hence, many people secretly cursed the Ye Family and prayed that they would never give birth to a daughter.

source: 因为叶家的势力庞大，若是再结亲，强强联手，那他们老二一家想翻身就更难了。
en_us: If the two powerful families were united through a marriage, there would be no room for Xu Yuan and her parents to make a comeback.

source: 因为叶漓的事情，叶枫和他的关系彻底闹崩。
en_us: Ye Feng's relationship with him broke down because of Ye Li's matter.

source: 因为叶漓的变化。
en_us: It was because of Ye Li's changes.

source: 因为叶漓的变化太大，他已经拿不准对方了，甚至觉得如今的叶漓好像是陌生人。
en_us: Due to the major changes that happened to Ye Li, he could no longer figure her out.He even felt that Ye Li seemed just like a stranger.

source: 因为叶漓看他的眼神很冷，冷的让人心中发凉。
en_us: Reason being, the hostility in Ye Li's gaze when she looked at him was enough to make his heart turn cold.

source: 因为她从小就学习大提琴，现在考到了八级，在学校中已经算是无人能及的存在，能被称为学校的文艺女神，这不是没有原因的。
en_us: Since she started learning to play the cello when she was a child, she had already gone through several music exams and advanced to Grade Eight. In school,no one could compare to her and she had every reason to be labeled as the Goddess of the Arts.

source: 因为她们都是用钱堆上来的，私下名声差的要死，而且都不是文艺社的人，她丝毫不担心。
en_us: Deep down, they had a terrible reputation and were not from the Arts Society either. Hence, she was not worried at all.

source: 因为她发现叶漓的微博，正以一个可怕的速度，暴露在了大家的视线。
en_us: Reason being, she discovered that Ye Li's Twitter account was rapidly gaining exposure.

source: 因为她根本就没有叫这个女孩，她什么时候跟上来的？
en_us: 'Since when did this girl tag along?'

source: 因为妹妹告诉他们在学校遭受过欺负之后，叶洛就十分小心，甚至还暗地里让人盯着，就想看看，到底是什么不长眼的人敢打她的主意。
en_us: Ye Luo had been extremely careful ever since his younger sister Ye Li told them that she had been bullied at school. He even secretly had people keep close tabs on her in school to see if any brazen people would dare to bully her again.

source: 因为当初发生这些事情的时候，他们都还很小，所以并没有什么感觉，只有已经懂事的了大哥很是不喜欢这对母女，当初她竟然还埋怨他说他过分，现在想想，还真是愚蠢。
en_us: When those things happened, they were still very young and hence, did not feel too emotionally affected. However, her eldest brother, who had already become conscious of the events around him, greatly disliked the pair of mother and daughter. Yet, she even resented him and criticized him for being overboard. After recalling those matters, she felt that she was really silly.

source: 因为联姻一事，她可谓是恨极了他们。
en_us: She detested them to the core because of the arranged marriage that she had been forced into.

source: 因为自己的十八岁，什么都没有。
en_us: Reason being, she received nothing for her eighteenth birthday.

source: 因为这三人，随便一个，都是这帝都能翻云覆雨的存在。
en_us: They were extremely powerful existences who could cause a storm.

source: 因为这个男人，是她最大的靠山。
en_us: Reason being, this man was her greatest backer and supporter.

source: 因为这事是禁忌，叶家从没有人敢提。
en_us: No one in the Ye Family dared to mention it because it was taboo.

source: 因为那个于向阳，和哥哥玩，根本就是不安好心！
en_us: Reason being Yu Xiangyang had ill intentions for being friends with her brother!

source: 因此叶漓可没对叶眉少感激过，觉得她才是真正对自己好，关心自己的人。
en_us: Hence, Ye Li was extremely grateful towards Ye Mei and she felt that the latter was the one who was truly concerned about her and genuinely treated her welll.

source: 因此，不少人挤破了脑袋都想进来。
en_us: Hence, many people racked their brains and tried hard to get into the Faculty of Arts.

source: 因此，同徐凤年的关系再次降到冰点，甚至觉得，父亲和哥哥们出事，都是这个一手遮天的男人暗地所为，于是吵闹着要离婚。
en_us: Hence, her relationship with Xu Fengnian became extremely strained again and she even felt that the invincible man, Xu Fengnian, was the one who caused her father and brothers to encounter that mishap. She thus kicked up a huge fuss and demanded a divorce.

source: 在叶家这群兄弟和徐凤年面前，他无疑是被碾压的存在。
en_us: Compared to the Ye Family brothers and Xu Fengnian, he was way inferior.

source: 在大家看来，叶眉就成了弱势的受害者。
en_us: Ye Mei became a vulnerable victim in everyone's opinion.

source: 在她很小的时候，因为两家的关系好，会经常往徐家跑。
en_us: When she was little, she used to visit Xu Fengnian's home very frequently because of the close friendship between the two families.

source: 在她记忆中，叶漓一直是因为相貌而自卑抬不起头的人。
en_us: In her memory, Ye Li had always had an inferiority complex because of her looks, and never dared to hold her head high.

source: 在学校的人气堪比叶枫。
en_us: She was on par with Ye Feng in terms of popularity.

source: 在学校，他能混的这么好，全靠自家三哥哥的帮忙。
en_us: He managed to gain so much popularity in school, all thanks to her third brother!

source: 在这个学校，多的是欺软怕硬的主。
en_us: Most of the students in this school liked bullying the weak but were afraid of those who were stronger.

source: 在这个网络时代，不少人都借此为自己带来关注。
en_us: In this digital age, many would use that to bring attention to themselves.

source: 场地中最为中心的位置。
en_us: In the center of the venue, a woman dressed in a red gown was being surrounded by a bunch of socialites.

source: 声音低沉，带着几分疑惑。
en_us: His voice was low and he sounded a little doubtful.

source: 备注上的老公两个大字，简直不要太刺眼！
en_us: 'She saved his contact as 'Hubby', how eye-catching!'

source: 外面的人谁提到文艺系的人，不都是女神女神的叫。
en_us: Almost all girls in the Faculty of Arts would be deemed as goddesses to others.

source: 夜幕。
en_us: It was nighttime.

source: 夜幕降临。
en_us: Night fell.

source: 大不了自己凑点就够了。
en_us: She would just combined several cards.

source: 大儿子一向沉稳，很少能有事能拉动他的情绪。
en_us: His eldest son had always been composed and his emotions would rarely get affected.

source: 大多数人都是在问关于叶漓和枫神吃饭一事。
en_us: Most people were asking about Ye Li having lunch with Ye Feng.

source: 大夫人和二夫人等人还要招待宾客，也没多留。
en_us: Mrs. Xu and her sister-in-law, Kong Yun, did not stay at the dining table because they still had to entertain some guests.

source: 大夫人笑着点了点头，没有说话，笑容更没有达眼底。
en_us: Mrs. Xu nodded with a mirthless smile without saying another word.

source: 大嫂想要儿媳妇，可人家还不一定愿意。
en_us: Although her sister-in-law wanted a daughter-in-law, Ye Li might not be willing to marry Xu Fengnian.

source: 大家不明所以。
en_us: Everyone did not understand it.

source: 大家只知道她家很有钱，叶漓的生活很奢侈，但是没有人知道她就是那个第一世家的宝贝千金。
en_us: Everyone only knew that Ye Li had a wealthy family and lived a luxurious life. However, no one knew that she was the precious daughter of the top family in the capital.

source: 大家只知道这个男人是靠着自己的努力一步步走到这个地位，是励志男神，是大家学习的对象。
en_us: Everyone only knew that Yu Xiangyang had worked hard to get to where he was, and even saw him as an inspirational idol who was their role model.

source: 大家听此，也是怪异的看向叶眉。
en_us: Everyone looked at Ye Mei peculiarly after hearing her words.

source: 大家对这个已经数十年没有露面的叶家小姐可是好奇的很。
en_us: Everyone was extremely curious about the daughter of the Ye Family who had never shown her face for several decades.

source: 大家已经懵逼了。
en_us: They were astounded.

source: 大家惊愕的看着叶漓，满眼不可置信。
en_us: Everyone looked at Ye Li in shock and disbelief.

source: 大家无比懊悔的同时，又埋怨为什么叶漓藏得这么深。
en_us: While everyone was filled with regret, they also lamented about the fact that Ye Li had concealed her identity so well.

source: 大家的目光刷地一下又落到了徐凤年身上，一脸的怀疑。
en_us: All eyes were suddenly on Xu Fengnian and they all seemed to be in suspicion.

source: 大家看着久违的男神，这会儿都兴奋极了。
en_us: Everyone was excited to see their idol whom they had not seen for a long time.

source: 大家看着她那几乎掐的出水的肌肤，嫉妒的不行。
en_us: Everyone was filled with jealousy when they looked at her supple skin.

source: 大家知道肯定是刚刚的事情被人告上去了。
en_us: Everyone knew that someone must have reported to the teacher about what happened.

source: 大家能这么快认出她，也是因为本就有过去帝都大学堵这个人的想法，早已打听过。
en_us: Everyone managed to recognize her quickly because they were planning to mob her at Beijing University. Hence they had long found out about her.

source: 大家虽然觉得奇怪，但是也没多想，毕竟两人从小一起长大。
en_us: Although everyone found it peculiar, they did not think much of it.After all, the two of them had grown up together.

source: 大家都以为叶漓这是心虚了，所以才删了这些关于于向阳的微博。
en_us: Everyone thought that Ye Li deleted all the tweets about Yu Xiangyang because she felt guilty.

source: 大家都以为是因为他儿子叶枫在这里上学，所以才会投资成为最大的股东。
en_us: Everyone thought that he only invested that much money to become the largest shareholder becuase his son, Ye Feng was a student in the school.

source: 大家都在小心的打量着这三个男人。
en_us: Everyone was carefully scrutinizing the three men.

source: 大家都惊呆了。
en_us: Everyone was dumbfounded.

source: 大家都知道她是第一世家叶家的大小姐，所以主动结交的人很多。
en_us: Everyone knew that she was the heiress of the Ye Family and hence, many took the initiative to get to know her.

source: 大家都说她的眼睛像是狐狸精。
en_us: Everyone said that her eyes were like that of a vixen.

source: 大家闻声看去，就见一穿着水蓝色旗袍，头发挽在耳后，十分优雅温婉的贵妇走了过来。
en_us: Everyone looked over, only to see a noble lady who was gentle and elegant. She was walking over in a light blue Cheongsam dress, her hair tucked behind her ears.

source: 大家闻言，纷纷点头让路。
en_us: Everyone nodded and made way for her after hearing her words.

source: 大家面面相觑。
en_us: Everyone looked at each other.

source: 大家面面相觑，没说什么。
en_us: Everyone looked at each other and remained silent.

source: 大家高高兴兴的在楼下说说笑笑。
en_us: Everyone was chatting and laughing merrily downstairs.

source: 大房只有一个儿子，徐凤年。
en_us: Xu Fengnian was the only grandson.

source: 天王老子来，也救不了他了。
en_us: 'Now even the king can't save him.'

source: 太奇怪了，明明只是过了一个星期的时间，怎么可能就发生了这么大的转变？
en_us: 'It's too strange. It's only been a week, how could she have changed so much?"

source: 太过分了！
en_us: 'It's too much!'

source: 奇怪，按现在的情况，叶漓不应该是要死要活的闹吗？
en_us: 'That's strange. Given the current situation, shouldn't Ye Li be throwing a huge tantrum and getting all hysterical?'

source: 女人狭长的双眼微微眯了眯，她和徐媛有几分相似，但是比起徐媛来，更多了几分女人的魅力和深不可测。
en_us: The woman squinted her long and narrow eyes. She looked somewhat similar to Xu Yuan but compared to Xu Yuan, she had a greater feminine charm and was much more mysterious.

source: 女佣顿时忐忑的说：“大小姐，每天的菜单都是厨房根据您的喜好准备的，我也不太清楚。”
en_us: The maid immediately said anxiously, "Missy, the dishes served everyday are prepared according to your preferences. I'm not very sure."

source: 女儿很小的时候，就被他经常带着去徐家玩。
en_us: When Ye Li was a child, he used to bring her to the Xu Family to play rather frequently.

source: 女儿长大后就不怎么亲近自己，难得这么撒娇一次，叶明那颗冷硬的心都快化了，这会儿可能女儿要天上那星星月亮，他可能都会毫不犹豫的答应下来，于是只得无奈点头道：“好好好，爸爸听你的。”
en_us: After Ye Li grew up, she grew distant from him and it was rare for her to be coquettish with him. Ye Ming's stone-like heart almost melted and at this moment, he would probably give her anything she wanted without hesitation, even if she wanted the moon and the stars. Hence, he had no choice but to nod helplessly and say, "Okay, okay, okay, I'll listen to you."

source: 女同学们却嫉妒的眼都红了。
en_us: The female students were filled with jealousy.

source: 女同学却没注意，只是惊愕之余，一下就后悔了。
en_us: However, the girl did not pay attention to it and simply felt stunned, after which she immediately regretted her actions.

source: 女同学本来都以为自己要完蛋了，没想到叶漓会突然这么说，她先是震惊，随后有些难以置信的看她：“你，你的意思是，不找我麻烦了？”
en_us: The female student originally thought that it was going to be over for her but to her surprise, Ye Li actually said those words. After being shocked, she looked at Ye Li in disbelief and asked, "You mean, you won't find trouble with me anymore?"

source: 女孩却一下就热情了起来：“真的吗？没想到我哥哥班上还有你这么漂亮的女生，我叫徐倩，你叫什么？”
en_us: However, his younger sister immediately became enthusiastic and friendly. "Really? I didn't expect my brother to have a classmate as pretty as you are. My name is Xu Qian, what about you?"

source: 女孩叫做孟非，家里是做房地产的，也就是暴发户，家里很是有钱，这会儿她的手已经包扎好了，正一脸阴沉的站在父母身边。
en_us: That girl was named Meng Fei and her family ran a business in the real estate industry. They were upstarts and were extremely wealthy. Now, her hand had been bandaged, and was standing beside her parents with a sullen expression.

source: 女孩子还是要软软糯糯的才好。
en_us: It was better for girls to be soft and tender.

source: 女孩脖颈处白嫩嫩的肌肤吸引了他的注意，他趴在桌上，凑过脑袋喊了一声：“小胖回校了？”
en_us: The white and tender skin of her neck attracted his attention. Laying on the table, he inched closer and asked, "The little fatty has returned to school?"

source: 女孩长得很可爱，打扮的也是娇俏的很，很是讨人喜欢的类型。
en_us: The girl looked extremely adorable and she was dressed in a lovely outfit. She looked extremely likable.

source: 女服务员尴尬的接过黑卡，赶忙点头退了下去。
en_us: The sales assistant awkwardly took the black card, hurriedly nodded and left.

source: 女生一下就涨红了脸。
en_us: The girl's face became flushed immediately.

source: 女生不查，被她踢了个准，顿时疼的弯了腰。
en_us: The girl immediately bent over in pain without even checking who the person who kicked her was.

source: 女生也是吓到了，想要收却已然来不及，手掌心直接就插了上去。
en_us: The girl was astonished too. She wanted to retract her hand but it was already too late to do so. Her palm had already been stabbed by the pen.

source: 女生洗手间就在楼梯后的位置，以至于徐凤年刚走上叶漓班级的楼层，就听到了声音，其中还夹杂着女孩子的哭喊。
en_us: The ladies' was located right after the stairs. Hence, as soon as Xu Fengnian reached the floor that Ye Li's classroom was on, he heard the cries and screams of the girl.

source: 她一发文，粉丝们顿时就出来了。
en_us: As soon as she posted that tweet, her fans swarmed to reply to it.

source: 她一向乖巧，从来不会向叶明拿钱，叶父也不会管这些小事，平时三个哥哥更不会给她零花钱了，所以叶眉的钱都是她妈妈给的。
en_us: She had always been obedient and would never ask Ye Ming for money. Ye Ming would not pay attention to such matters either. Usually, her brothers would never give her any allowance too, so Ye Mei had always been getting her money from her mother.

source: 她一向觉得无所不能的父亲，竟然因为自己，险些对一个小辈下跪道歉！
en_us: Her father, whom she always thought was invincible, almost knelt down to apologize to a junior for her sake!

source: 她一坐下，就开始冷冷的教训起了叶漓来：“叶漓，你什么意思，我罚你站你不服气是不是，竟然还敢逃课，我看你这个书是不想读了吧，你家里人知道你这样做吗？他们含辛茹苦送你来这种贵族学校上学，你就是这样报答他们的，学习差就算了，还不好好听话，你爸妈平时是怎么管教你的啊！怎么就这么没教养，信不信我叫你家长过来谈话！”
en_us: As soon as she sat down, she began to lecture Ye Li hostilely, "Ye Li, what do you mean? Are you feeling disgruntled because I punished you by making you stand outside the classroom? How dare you skip class and play truant? You don't want to pursue an education anymore, do you? Does your family know you do this? They sent you to a school for nobles and this is how you repay them? Not only do you have poor grades,you're disobedient too. What do your parents usually teach you? Why are you so uncultured? Do you believe that I'll call your parents and get them to come here for a chat!?!"

source: 她一天不原谅自己，叶枫就不会再和他接触。
en_us: As long as she did not forgive him, Ye Feng would never interact with her again.

source: 她一头长发盘在了脑后，头上只是带了一些十分简约的装饰品，原本遮挡额头的刘海也不见了，只留下一些细软的碎发随风飘动。
en_us: Her long hair was tied up at the back of her head and there were a few simple decorative accessories on them. Her bangs that originally covered her forehead were already gone, leaving behind only some soft and tender segments of hair.

source: 她一脸不可置信的看着叶漓冷漠的脸，突然就反应过来，叶漓上一次说的那些话是什么意思了。
en_us: She looked at Ye Li's cold and sullen expression in disbelief and suddenly realized what Ye Li meant previously.

source: 她一走出去就被围上了。
en_us: She was surrounded as soon as she walked out.

source: 她不仅要回去，还要让努力变得优秀，将那些曾经欺辱过她的人，狠狠踩在脚下。
en_us: Not only would she go back to school, she would also put in the effort to become an outstanding student, so as to climb above those who used to bully her.

source: 她不屑的瞥了撇嘴：“再说了，我之前对他也同大多粉丝一样，纯属爱慕，脑残追星，哪有什么深刻的感情，还没有那个值得我去为他死的影响力，懂？”
en_us: Pursing her lips disdainfully, she continued, "Besides, I only purely adored him previously, just like most of his retarded die-hard fans. My feelings for him aren't deep at all and he doesn't have enough influence for me to want to kill myself for him, understand?"

source: 她不是傻子，知道父亲态度的变化肯定是因为发生了什么事，所以心里也是有些慌了神，可这会竟然让她下跪道歉，她怎么可能愿意，死也不要！
en_us: She was not a fool and she knew that something major must have happened for her father's attitude to change so drastically. Hence, she was flustered for a while but she would never be willing to kneel down and apologize to Ye Li. Over her dead body!

source: 她不知道自己到底哪里不好，所以心里不甘。
en_us: She felt indignant because she did not know why she wasn't worthy of him.

source: 她不过是说说客套话。
en_us: She was just saying a few words out of courtesy.

source: 她不顾几个男人的担忧，急忙问：“哥，今天是什么几年几月？”
en_us: Ignoring the fact that they were worried, she anxiously asked, "Brother, what's the date today?"

source: 她为了保持身材，每天吃的都很少，哪里像是叶漓一样，想吃什么就吃什么，不过她也乐得开心，自己在家虽然比不过叶漓，但是到了外面，呵呵。
en_us: In order to stay in shape, Ye Mei ate very little food everyday, unlike Ye Li who would eat whatever she wanted to her heart's content. However, she was elated about that. Although she was inferior to Ye Li at home, things were different outside.

source: 她为什么要这么做呢？
en_us: 'Why did she do that?'

source: 她之前因为自杀一事，在家中休养了一个星期，根本就不知道这老师安排了论文要写。
en_us: She had been recuperating at home for a week after she tried to commit suicide. She did not know that the teacher had tasked them to write a paper.

source: 她之前食量很大，以至于现在每一餐吃的很少，能量不够消耗，每次熬不到中午，就饿得够呛。
en_us: Previously, she had a huge appetite and would eat large portions for every meal. However, she had reduced her food intake greatly and was in a constant caloric deficit. Hence, she would be incredibly famished before noon each day.

source: 她也才知道，原来自己的母亲，曾遭受了这么一遭。
en_us: She also found out how much her mother had actually suffered back then.

source: 她二十三岁嫁给徐凤年，虽然前面恨得多，但是结了五年婚，之后意外怀孕之后也就收了心，同那个男人好好过日子。
en_us: Although she was filled with hatred at the beginning of her marriage to Xu Fengnian when she was 23 years old, she stopped feeling that way after an accidental pregnancy. She decided to live on properly with him.

source: 她从见徐凤年的第一眼，就决定了好长大了一定要嫁给他。
en_us: Since the very first time she saw Xu Fengnian, she had already made up her mind to marry him when she grew up.

source: 她以为自己还是上辈子那个受了什么苦都只会往嘴里咽的怂包吗？
en_us: 'Does she think I'm still that wimp who would suffer in silence like I did in my previous life?'

source: 她们始终不太相信，叶眉拿了一张空卡来买天价礼服。
en_us: They couldn't believe that Ye Mei would buy a gown with an ostentatious price tag, using an empty card.

source: 她们应该庆幸自己是女人，不然他早就动手了。
en_us: They should be thankful that they're women. Otherwise, he would have long hit them.

source: 她们疯狂的挖掘关于叶漓的一切信息，很快就将她之前那些黑料挖了出来，并请各种营销号发到网上，一瞬间就冲上了热搜！
en_us: They embarked on a crazy search for information about Ye Li's background and profile and soon, they found all the controversies that revolved around her in the past, and even got some online marketing accounts to upload the information on the internet, after which it immediately ended up on the list of hottest searches.

source: 她们知道叶家很有钱，所以选裙子的时候也没有客气。
en_us: They knew that the Ye Family was very wealthy and hence, did not stand on ceremony with Ye Mei when choosing a gown they wanted.

source: 她们自然是要找茬。
en_us: They were naturally trying to make things hard for her.

source: 她们认识叶眉好多年，从来就没听说过她有什么姐姐。
en_us: They had known Ye Mei for many years and had never heard of her having any sister.

source: 她们这么多人，叶漓就一个，还怕弄不死她吗？
en_us: There were so many of them and Ye Li was outnumbered. They could easily deal with her.

source: 她们这些名媛也是有个可以相互交流的圈子，而这些年来，叶眉一直以叶家小姐这个称号在这个圈子里打出了名号。
en_us: Those socialites were in an exclusive social circle where they often interacted with each other. Throughout the years, Ye Mei had always introduced herself as Miss Ye Mei, the heiress of the Ye Family.'

source: 她伸手点进了叶漓的微博，发现粉丝已经一百多万了，而且还在以恐怖的速度增长。
en_us: She reached out and tapped on Ye Li's Twitter account to see that she already had more than a million followers and the number was still increasing rapidly at a horrifying rate.

source: 她但凡敢从前面出，恐怕今儿个都不用上课了。
en_us: If she were to leave by the main entrance, she probably wouldn't have to attend lessons anymore today.

source: 她低头掩饰了目光的时候，可爱到爆炸！
en_us: The way she looked down to hide her gaze was extremely adorable!

source: 她先是愣了一下，随即感觉胸口突然注入一股暖流。
en_us: After being stunned, she felt a sudden warmth in her chest.

source: 她其实不丑，只是肥肉掩盖住了原本精致的五官，从这张脸上就可以看出，若是瘦下来，该是多么的漂亮。
en_us: She was actually not ugly, but the fat on her face caused her exquisite features to be hidden. It was obvious that she would be gorgeous if she lost some weight.

source: 她几句话就将自己从刚刚误会中抽离，表示自己只是关心急切才会误会。
en_us: She managed to get herself out of the misunderstanding just now in a few words, expressing her stand that she had only gotten the wrong idea because she was anxious and worried.

source: 她刚准备发送，一旁的服务员就走了过来，为难的说：“抱歉小姐，我们店铺是不能拍照的。”
en_us: Just as she was about to send it, a sales assistant walked over and seemed to be in a spot. "Miss, I'm sorry but you're not allowed to take photos in our store."

source: 她刚刚打电话各种哀求母亲，又被骂了一顿，才好不容易拿到了钱。
en_us: She had just called her mother to beg her in every way she could and even suffered a scolding before she was given the money.

source: 她原本以为是叶眉。
en_us: She initially thought that she was Ye Mei.

source: 她只得吞下这口气，委委屈屈的说：“对不起姐姐，我不是故意的，我看你那么喜欢学长，那天又跳了河，才会这样以为，你不要误会，我也是太担心你了。”
en_us: She had no choice but to bear with it and say aggrievedly, "I'm sorry, Sister, I didn't mean it. I just assumed so because I know how much you fancied Senior and you jumped into the river that way. Please don't get the wrong idea, I was just too worried about you."

source: 她可不觉得曾经的自己，能吸引这个帅哥的注意。
en_us: She did not think that the old her could attract the attention of the hunk.

source: 她吸了吸鼻子，有些委屈：“徐凤年？我是阿漓，你什么时候娶我回家？”
en_us: She sniffled and said, feeling a little aggrieved, "Xu Fengnian, I'm Li, when will you marry me?"

source: 她和主任偷情，被人家原配发现，直接找来了学校对她就是一阵暴打，还直接将两人小树林私会的视频发到了校园网上，劲爆的不行，一时之间，这两人都成为了同学们茶前饭后都要议论的八卦题材。
en_us: She had an illicit affair with the dean. After the dean's wife found out, she barged straight to school and beat Cheng Yan up into a pulp. She even uploaded the video of their rendezvous in the woods, onto the campus website. It sparked a huge uproar and all of a sudden, the adulterous pair became the topic of gossip for everyone.

source: 她和主任在一起一年多了，一直是地下情关系，也很隐秘，没人知道。
en_us: She had been in a clandestine relationship with the dean for more than a year but they were very secretive and no one knew about it.

source: 她和周雅议论了这事一下午。
en_us: She spent the entire afternoon discussing the matter with Zhou Ya.

source: 她和徐媛都是在国外留学的。
en_us: Both her and Xu Yuan had studied abroad.

source: 她喜欢徐凤年很久了，从第一次见到这个男人的时候，就被他的颜值所折服，一直心心念念。
en_us: She had been carrying a torch for Xu Fengnian for a long time. When she saw him for the first time, she was extremely attracted to his good looks and had been thinking about him ever since then.

source: 她嘲讽的扯了扯嘴角，“不用了。”
en_us: She smirked mockingly and said, "No need for that."

source: 她回了一句：“好的三哥哥，我要吃学校门口那家的清蒸鲤鱼。”
en_us: She answered, "Alright, I'd like to eat the steamed carp from the restaurant at the entrance of our school."
